In [25]:
println("Sonu Amrith")

Sonu Amrith

In [2]:
/*
Installing Scala on Jupyter Notebook
1.Install the Java
2.Install the Scala
3.Install the Spark
4.Install the Anaconda and set the path in Path Environment variable
5.install the packages using this command in windows powershell 
  i) (pip install spylon-kernel)
  ii) python -m spylon_kernel install
*/

In [26]:
import org.apache.spark.sql.types._
val schem=StructType(Array(StructField("Serial Number",StringType,true),StructField("Company Name",StringType,true),StructField("Employee Markme",StringType,true),StructField("Description",StringType,true),StructField("Leave",StringType,true)))

import org.apache.spark.sql.types._
schem: org.apache.spark.sql.types.StructType = StructType(StructField(Serial Number,StringType,true), StructField(Company Name,StringType,true), StructField(Employee Markme,StringType,true), StructField(Description,StringType,true), StructField(Leave,StringType,true))

In [3]:
val df1=spark.read.format("csv").schema(schem).option("header","true").csv("C:/Users/amrit/Downloads/Sample10K.csv")

df1: org.apache.spark.sql.DataFrame = [Serial Number: string, Company Name: string ... 3 more fields]

In [5]:
df1.printSchema

root
 |-- Serial Number: string (nullable = true)
 |-- Company Name: string (nullable = true)
 |-- Employee Markme: string (nullable = true)
 |-- Description: string (nullable = true)
 |-- Leave: string (nullable = true)

In [6]:
// select only the name and salary in this dataframe
df1.show(5)

+-------------+--------------------+---------------+------------------+-----+
|Serial Number|        Company Name|Employee Markme|       Description|Leave|
+-------------+--------------------+---------------+------------------+-----+
|9788189999599|      TALES OF SHIVA|           Mark|              mark|    0|
|9780099578079|1Q84 THE COMPLETE...|HARUKI MURAKAMI|              Mark|    0|
|9780198082897|            MY KUMAN|           Mark|              Mark|    0|
|9780007880331|THE GOD OF SMAAL ...|  ARUNDHATI ROY|4TH HARPER COLLINS|    2|
|9780545060455|    THE BLACK CIRCLE|           Mark|4TH HARPER COLLINS|    0|
+-------------+--------------------+---------------+------------------+-----+
only showing top 5 rows

In [7]:
//Understanding the data

/*
1.Are there any null values,if so how do i find them
2.How many rows are there,how do i find them?
3.What does employee markme column is telling here, does it has any unique values
*/

In [6]:
// How many rows are there in this csv file
df1.select("Company Name").count() // There are totally 9813 rows are there

res3: Long = 9813

In [9]:
// Out of these 9813 rows how many rows are there in which atleast one column has null value?
df1.where(df1("Company Name").isNull || df1("Employee Markme").isNull || df1("Description").isNull||df1("Leave").isNull).count()

//So out of 9813 rows we have 557 rows with null values, either we can drop it or we can replace with most repeated values

res6: Long = 557

In [10]:
(df1.where(df1("Company Name").isNotNull).groupBy("Company Name").count().orderBy(desc("count"))).show()

//This result shows the Company names are repeated and they are not unique

+--------------------+-----+
|        Company Name|count|
+--------------------+-----+
|     THE JUNGLE BOOK|    8|
|         ANIMAL FARM|    8|
|         THE PROPHET|    7|
|     TREASURE ISLAND|    7|
|               HEIDI|    7|
|   THE INVISIBLE MAN|    6|
|THE STORY OF MY LIFE|    6|
| THINK AND GROW RICH|    5|
|      THE ART OF WAR|    5|
|   THE LITTLE PRINCE|    5|
|MERI PRIYA KAHANIYAN|    4|
|         THE TEMPEST|    4|
|THE DIARY OF A YO...|    4|
|THE CANTERVILLE G...|    4|
|           GITANJALI|    4|
|           PETER PAN|    4|
|   AS A MAN THINKETH|    4|
|THE POWER OF POSI...|    4|
|THE GIRL ON THE T...|    4|
|THE POWER OF YOUR...|    4|
+--------------------+-----+
only showing top 20 rows

In [11]:
df1.select("Serial Number","Company Name","Description","Employee Markme").where($"Company Name"==="THE JUNGLE BOOK").show()

/*
Observation:
Each Company name is repeated so i further dig in to see other columns along with the company name so that i can see how they are
related.
1.Company Name is equal to Book name
2.Description defines the publication company name
3.Employee Markme defines author name.One more thing to be noted here is that,when author name is not known it's noted as "Mark"

*/

+-------------+---------------+-------------------+---------------+
|Serial Number|   Company Name|        Description|Employee Markme|
+-------------+---------------+-------------------+---------------+
|9789351213703|THE JUNGLE BOOK|  BPI INDIA PVT LTD|           Mark|
|9789386360403|THE JUNGLE BOOK|  BPI INDIA PVT LTD|           Mark|
|9781846650635|THE JUNGLE BOOK|      CHARLES BAKER|           Mark|
|9789350892671|THE JUNGLE BOOK|          DREAMLAND|           Mark|
|9789385907326|THE JUNGLE BOOK|        KORAL BOOKS|           Mark|
|9789382677192|THE JUNGLE BOOK|     MAANU GRAPHICS|RUDYARD KIPLING|
|9788129131324|THE JUNGLE BOOK|          RUPA & CO|KIPLING LIBRARY|
|9789351994527|THE JUNGLE BOOK|V-CONNECT EDUCATION|           Mark|
+-------------+---------------+-------------------+---------------+

In [12]:
// Are there any books which has author only as "Mark"

In [13]:
(df1.where(df1("Employee Markme").isNotNull).groupBy("Employee Markme").count().orderBy(desc("count"))).show(30)
/*
From the data i can see these are Authors basically and one more thing is some of the books are not given any author name at all
they are just named with the "." or "-"
*/

+-------------------+-----+
|    Employee Markme|count|
+-------------------+-----+
|               Mark| 3679|
|                  -|  407|
|                  .|  183|
|  """Che"" Guevara"|   78|
|        RUSKIN BOND|   75|
|     SANJEEV KAPOOR|   58|
|               NILL|   42|
|         nita mehta|   41|
|                NIL|   23|
|DEVDUTT PATTAMarkIK|   22|
|                BPI|   21|
|                MHE|   21|
|      DALE CARNEGIE|   20|
|            Roy Ron|   18|
|         NITA MEHTA|   17|
|    KHUSHWANT SINGH|   17|
|        ENID BLYTON|   16|
|           LADYBIRD|   16|
|              HERGE|   16|
|     DANIELLE STEEL|   16|
|         ROALD DAHL|   15|
|     sanjeev kapoor|   15|
|   GERONIMO STILTON|   15|
|     JEFFREY ARCHER|   14|
|         TRISHMarkS|   14|
|WILLIAM SHAKESPEARE|   14|
|  Osborne Mary Pope|   13|
|    GERNIMO STILTON|   13|
|          Premchand|   13|
|            SANJEEV|   13|
+-------------------+-----+
only showing top 30 rows

In [14]:
(df1.where(df1("Description").isNotNull).groupBy("Description").count().orderBy(desc("count"))).show()

+--------------------+-----+
|         Description|count|
+--------------------+-----+
|                 RPH|  521|
|           RUPA & CO|  337|
|       PENGUIN BOOKS|  319|
|HARPERCOLLINS PUB...|  216|
|        PUSTAK MAHAL|  195|
|            WESTLAND|  188|
|    G.K. PUBLICATION|  180|
|           DREAMLAND|  165|
|       RAJPAL & SONS|  128|
|      HACHETTE INDIA|  124|
|JAICO PUBLISHING ...|  124|
|          SCHOLASTIC|  121|
|RUPA PUBLICATIONS...|  120|
|   HIND POCKET BOOKS|  119|
|CENGAGE LEARNING ...|  114|
|STERLING PUBLISHE...|  112|
|          GREEN GOLD|   98|
|DREAMLAND PUBLICA...|   94|
|         MAPLE PRESS|   92|
|   Orient Paperbacks|   88|
+--------------------+-----+
only showing top 20 rows

In [15]:
/*
Assumption: 
1.By exploring the data above, i observed that some of the author names(for the same book) became unique because of the following
reasons
    i) By spelling mistakes
    ii)By using white spaces between words
    iii) some of them are shortcut initials(like first name and middle names are kept as alphabets)
So i'm assuming if the name is repeated multiple times then it's the original name so we can replace in the place of "Mark" or "-"

*/

In [4]:
val employeeReplace=df1.groupBy("Company Name","Employee Markme").count().orderBy(desc("count"))
val employeeReplace1=employeeReplace.withColumnRenamed("Company Name","company_name").withColumnRenamed("Employee Markme","employee_markme").toDF()
employeeReplace1.show()

+--------------------+--------------------+-----+
|        company_name|     employee_markme|count|
+--------------------+--------------------+-----+
|     THE JUNGLE BOOK|                Mark|    6|
|     TREASURE ISLAND|                Mark|    4|
|               HEIDI|                Mark|    4|
| THINK AND GROW RICH|     MarkPOLEON HILL|    4|
|         ANIMAL FARM|       GEORGE ORWELL|    4|
|THE STORY OF MY LIFE|        HELEN KELLER|    4|
|THE DIARY OF A YO...|          ANNE FRANK|    3|
|           GITANJALI|RABINDRAMarkTH TA...|    3|
|   AS A MAN THINKETH|         JAMES ALLEN|    3|
|THE GIRL ON THE T...|       PAULA HAWKINS|    3|
|         THE PROPHET|       Kahlil Gibran|    3|
|     ABRAHAM LINCOLN|                Mark|    3|
|   THE INVISIBLE MAN|                Mark|    3|
|HOW TO WIN FRIEND...|       DALE CARNEGIE|    2|
| ALICE IN WONDERLAND|                Mark|    2|
|             NEERAJA|                Mark|    2|
|        THUMBELIMark|                Mark|    2|
|           PETER PAN|          J M BARRIE|    2|
|                1984|       GEORGE ORWELL|    2|
|           AFTER YOU|          JOJO MOYES|    2|
+--------------------+--------------------+-----+
only showing top 20 rows

employeeReplace: org.apache.spark.sql.Dataset[org.apache.spark.sql.Row] = [Company Name: string, Employee Markme: string ... 1 more field]
employeeReplace1: org.apache.spark.sql.DataFrame = [company_name: string, employee_markme: string ... 1 more field]

In [5]:
// converting a dataframe to a List of values
import scala.collection.mutable.Map
// Goal is to convert the each row of a dataframe into the list.
val groupList=employeeReplace.select("Company Name","Employee Markme","count").collect().toList
/*
Using collect().toList==>i'm converting the entire dataframe to the list,but the collect() methods needs to be avoided on larger
datasets as it will result in out of memory problem
*/
var newMap:Map[String,String]=null;

import scala.collection.mutable.Map
groupList: List[org.apache.spark.sql.Row] = List([THE JUNGLE BOOK,Mark,6], [HEIDI,Mark,4], [THINK AND GROW RICH,MarkPOLEON HILL,4], [ANIMAL FARM,GEORGE ORWELL,4], [TREASURE ISLAND,Mark,4], [THE STORY OF MY LIFE,HELEN KELLER,4], [AS A MAN THINKETH,JAMES ALLEN,3], [THE PROPHET,Kahlil Gibran,3], [THE DIARY OF A YOUNG GIRL,ANNE FRANK,3], [THE GIRL ON THE TRAIN,PAULA HAWKINS,3], [ABRAHAM LINCOLN,Mark,3], [GITANJALI,RABINDRAMarkTH TAGORE,3], [THE INVISIBLE MAN,Mark,3], [CTET SUCCESS MASTER PLANNER FOR PAPER II,Mark,2], [THE ADVENTURES OF SHERLOCK HOLMES,Mark,2], [ANGELS & DEMONS,DAN BROWN,2], [108 MarkMES OF HANUMAN,Mark,2], [THE GURU OF JOY,FRANCOIS GAUTIER,2], [ALICE IN WONDERLAND,Mark,2], [HOW TO WIN FRIENDS AND INFLUENCE PEOPLE,DALE CARNEGIE,2], [AISA ...

In [6]:
var companyToEmployee:Map[String,String]=Map();
for(row<-groupList){
            val companyName:String=row.getString(0);
            val markMe:String=row.getString(1);
            if(companyToEmployee.contains(companyName)){
                if(companyToEmployee(companyName)=="Mark" && markMe!="Mark"){
                    //println(markMe,companyName)
                    companyToEmployee(companyName)=markMe

                }
            }
            else{
                companyToEmployee+=(companyName->markMe)
            }
            
        }

companyToEmployee: scala.collection.mutable.Map[String,String] = Map(SOCH BADLO ZINDAGI BADLO -> BRYAN TARESI, CITY OF ASHES -> Mark, HINDU HONE KA MATLAB -> VIJAY SANKAR MEHTA, KVS TEACHERS (PGT) COMMERCE GUIDE -> -, MY BIG BOOK OF ABC -> Mark, THE LITTLE GIANT BOOK OF  JOKES -> Joseph Rosenbloom, FALIT JYOTISH SUTRA(HND) -> SATYAMarkRAYAN JANGID, GARBHVATI VA SHISHUPALAN (HINDI) -> Mark, PEPPER LEARN TEAM SPIRIT -> Mark, HITOPADESH TALES -> Mark, THE TEMPEST -> WILLIAM SHAKESPEARE, MIDNIGHT CHILDREN -> SALMAN RUSHDIE, SSC (CPWD/CWC/MES) JE-CONV. SOLVED PAPERS ELECTRICAL ENGG PAPER-II 2017 -> Mark, MONSTER COLOURING BOOK (GIANT BOOK SERIES) -> WONDER HOUSE BOOKS, RRB JUNIOR ENGINEER -> Mark, THE ESSENCE OF BHAGWAD -> ATUL SAH, $ELLEBRITY -> GEORGE LOIS, THE PRINCESS WITH THE LONGEST HA...

In [9]:
import spark.implicits._
var lookupCol=companyToEmployee.toSeq.toDF("company_name","employee_mark")
lookupCol.show()
// Even after processing i can still see the "Mark" value whyy?

In [10]:
//Compare any of the column value before processing and after processing so that i can understand whether sol worked or not
//1.Before processing
df1.select("Company Name","Description","Employee Markme").where($"Company Name"==="THE JUNGLE BOOK").show()
//2.After Processing
lookupCol.where($"company_name"==="THE JUNGLE BOOK").show()

/*Observation:
Before processing the Jungle Book has different has different "Mark values" now in the lookup column i only see one original name
which indicates the solution worked
The "Mark" values in the lookup table is due to the fact,there is no other author values except "mark " for a book
*/

+---------------+-------------------+---------------+
|   Company Name|        Description|Employee Markme|
+---------------+-------------------+---------------+
|THE JUNGLE BOOK|  BPI INDIA PVT LTD|           Mark|
|THE JUNGLE BOOK|  BPI INDIA PVT LTD|           Mark|
|THE JUNGLE BOOK|      CHARLES BAKER|           Mark|
|THE JUNGLE BOOK|          DREAMLAND|           Mark|
|THE JUNGLE BOOK|        KORAL BOOKS|           Mark|
|THE JUNGLE BOOK|     MAANU GRAPHICS|RUDYARD KIPLING|
|THE JUNGLE BOOK|          RUPA & CO|KIPLING LIBRARY|
|THE JUNGLE BOOK|V-CONNECT EDUCATION|           Mark|
+---------------+-------------------+---------------+

+---------------+---------------+
|   company_name|  employee_mark|
+---------------+---------------+
|THE JUNGLE BOOK|RUDYARD KIPLING|
+---------------+---------------+

In [14]:
// Now replacing the Mark values with the processed values in the lookupCol dataframe
df1.join(lookupCol,df1("Company Name")==lookupCol("company_name"),"inner").show()

In [11]:
var df2=df1.withColumnRenamed("Company Name","company_name").withColumnRenamed("Serial Number","serial_number")

df2: org.apache.spark.sql.DataFrame = [serial_number: string, company_name: string ... 3 more fields]

In [12]:
df2.createOrReplaceTempView("temporary_table")
lookupCol.createOrReplaceTempView("lookupcol_table")

In [13]:
/*
Now the main goal i was having is to replace the employee_markme inside the original dataframe with the values present inside the
lookupCol dataframe.
I saw there is many to one relationship b/w the original dataframe and lookupCol dataframe, so i thought to join these two tables
using the company_name as a condition.
Tried using the Join operation function of a dataframe but it didn't worked
Hence i created a temporary view for two data frames and used spark sql query to perform the join operation
*/
var table=spark.sql("select t.serial_number,t.company_name,l.employee_mark,Description,Leave from temporary_table as t inner join lookupcol_table l on t.company_name==l.company_name")
table.show()

+-------------+--------------------+---------------+--------------------+-----+
|serial_number|        company_name|  employee_mark|         Description|Leave|
+-------------+--------------------+---------------+--------------------+-----+
|9788189999599|      TALES OF SHIVA|           Mark|                mark|    0|
|9780099578079|1Q84 THE COMPLETE...|HARUKI MURAKAMI|                Mark|    0|
|9780198082897|            MY KUMAN|           Mark|                Mark|    0|
|9780007880331|THE GOD OF SMAAL ...|  ARUNDHATI ROY|  4TH HARPER COLLINS|    2|
|9780545060455|    THE BLACK CIRCLE|           Mark|  4TH HARPER COLLINS|    0|
|9788126525072|THE THREE LAWS OF...|           Mark|  4TH HARPER COLLINS|    0|
|9789381626610|   CHAMarkKYA MANTRA|           Mark|  4TH HARPER COLLINS|    0|
|9788184513523|            59.FLAGS|           Mark|  4TH HARPER COLLINS|    0|
|9780743234801|THE POWER OF POSI...|           Mark|     A & A PUBLISHER|    0|
|9789381529621|YOU CAN IF YO THI...|          PEALE|     A & A PUBLISHER|    0|
|9788183223966|DONGRI SE DUBAI T...|           Mark|     A & A PUBLISHER|    0|
|9788187776005|MarkLANDA ADYTAN ...|           Mark|   AADISH BOOK DEPOT|    0|
|9788187776013|MarkLANDA VISHAL ...|              -|   AADISH BOOK DEPOT|    1|
|   8187776021|MarkLANDA CONCISE...|           Mark|   AADISH BOOK DEPOT|    0|
|9789384716165|LIEUTEMarkMarkT G...|           Mark|          AAM COMICS|    2|
|9789384716233|LN. MarkIK SUNDER...|            N.A|          AAN COMICS|    0|
|9789384850319|      I AM KRISHMark|   DEEP TRIVEDI|AATMAN INNOVATION...|    1|
|9789384850357|DON'T TEACH ME TO...|   DEEP TRIVEDI|AATMAN INNOVATION...|    0|
|9789384850364|MUJHE SAHISHNUTA ...|   DEEP TRIVEDI|AATMAN INNOVATION...|    0|
|9789384850746|  SECRETS OF DESTINY|   DEEP TRIVEDI|AATMAN INNOVATION...|    1|
+-------------+--------------------+---------------+--------------------+-----+
only showing top 20 rows

table: org.apache.spark.sql.DataFrame = [serial_number: string, company_name: string ... 3 more fields]

In [14]:
// checking whether the process of changing the values from "Mark" to "Original values" worked or not
//Before processing checking the "Mark me" column for "JUNGLE BOOK"
println("==============Before Processing===============")
df1.where($"Company Name"==="THE JUNGLE BOOK").show()
// After processing checking the "Mark me" column for "JUNGLE BOOK"
println("==============After Processing===============")
table.where($"t.company_name"==="THE JUNGLE BOOK").show()

==============Before Processing===============
+-------------+---------------+---------------+-------------------+-----+
|Serial Number|   Company Name|Employee Markme|        Description|Leave|
+-------------+---------------+---------------+-------------------+-----+
|9789351213703|THE JUNGLE BOOK|           Mark|  BPI INDIA PVT LTD|    1|
|9789386360403|THE JUNGLE BOOK|           Mark|  BPI INDIA PVT LTD|    0|
|9781846650635|THE JUNGLE BOOK|           Mark|      CHARLES BAKER|    1|
|9789350892671|THE JUNGLE BOOK|           Mark|          DREAMLAND|    0|
|9789385907326|THE JUNGLE BOOK|           Mark|        KORAL BOOKS|    2|
|9789382677192|THE JUNGLE BOOK|RUDYARD KIPLING|     MAANU GRAPHICS|    0|
|9788129131324|THE JUNGLE BOOK|KIPLING LIBRARY|          RUPA & CO|    0|
|9789351994527|THE JUNGLE BOOK|           Mark|V-CONNECT EDUCATION|    1|
+-------------+---------------+---------------+-------------------+-----+

==============After Processing===============
+-------------+---------------+---------------+-------------------+-----+
|serial_number|   company_name|  employee_mark|        Description|Leave|
+-------------+---------------+---------------+-------------------+-----+
|9789351213703|THE JUNGLE BOOK|RUDYARD KIPLING|  BPI INDIA PVT LTD|    1|
|9789386360403|THE JUNGLE BOOK|RUDYARD KIPLING|  BPI INDIA PVT LTD|    0|
|9781846650635|THE JUNGLE BOOK|RUDYARD KIPLING|      CHARLES BAKER|    1|
|9789350892671|THE JUNGLE BOOK|RUDYARD KIPLING|          DREAMLAND|    0|
|9789385907326|THE JUNGLE BOOK|RUDYARD KIPLING|        KORAL BOOKS|    2|
|9789382677192|THE JUNGLE BOOK|RUDYARD KIPLING|     MAANU GRAPHICS|    0|
|9788129131324|THE JUNGLE BOOK|RUDYARD KIPLING|          RUPA & CO|    0|
|9789351994527|THE JUNGLE BOOK|RUDYARD KIPLING|V-CONNECT EDUCATION|    1|
+-------------+---------------+---------------+-------------------+-----+

In [15]:
df1.where($"Employee Markme".isNull).show()

+-------------+--------------------+---------------+--------------------+-----+
|Serial Number|        Company Name|Employee Markme|         Description|Leave|
+-------------+--------------------+---------------+--------------------+-----+
|9788189999988|JAMSET  JI TATA: ...|           null|                 ACK|    0|
|9788184820553|               SURYA|           null|                 ACK|    0|
|   8184242832|ASTADALA YOGAMALA...|           null|ALLIED PUBLISHERS...|    1|
|9788131904330|          AT THE ZOO|           null|             B. JAIN|    1|
|9788190514279|VIYANJAN GYAN { H...|           null|    BLUE BERRY BOOKS|    0|
|   8170110122|PANCHATANTRA KI K...|           null| CHILDREN BOOK TRUST|    1|
|   8170110335|PANCHATANTRA KI K...|           null| CHILDREN BOOK TRUST|    1|
|   8170110580|PANCHATANTRA KI K...|           null| CHILDREN BOOK TRUST|    1|
|   8170110904|PANCHATANTRA KI K...|           null| CHILDREN BOOK TRUST|    1|
|   8170112311|PANCHATANTRA KI K...|           null| CHILDREN BOOK TRUST|    2|
|   8170115159|LAUT KE BUDDHU GH...|           null| CHILDREN BOOK TRUST|    0|
|   8189750232|  MarkITIK KAHANIYAN|           null| CHILDREN BOOK TRUST|    1|
|   8189750283|BANJARA HILL KE B...|           null| CHILDREN BOOK TRUST|    1|
|9788170110445|STORIES FROM PANC...|           null| CHILDREN BOOK TRUST|    1|
|9780007845811|COLLINS EASY LEAR...|           null|    COLLINS BUSINESS|    1|
|9788184510010|MY NEW  COLOURING...|           null|           DREAMLAND|    0|
|9788184516494|KID'S 4TH ACTIVIT...|           null|           DREAMLAND|    0|
|9788184514827|PLAY WITH STICKER...|           null|           DREAMLAND|    0|
|9788184517248|UGLY DUCKLING : P...|           null|           DREAMLAND|    4|
|9788184517255|SINDBAD : POP-UP ...|           null|           DREAMLAND|    4|
+-------------+--------------------+---------------+--------------------+-----+
only showing top 20 rows

In [16]:
table=table.na.fill("") // filling the null values with an empty string in columns
table=table.toDF

table: org.apache.spark.sql.DataFrame = [serial_number: string, company_name: string ... 3 more fields]
table: org.apache.spark.sql.DataFrame = [serial_number: string, company_name: string ... 3 more fields]

In [21]:
// I want to save this processed data present inside dataframe to be saved permanently inside a MS SQL Database
/*
In order for the Spark to recognize the MS SQL Jdbc driver add the JDBC driver path in the "PATH" environment variable and also
place the Jar inside the lib folder of spark which i downloaded.
*/
val driverClass = "com.microsoft.sqlserver.jdbc.SQLServerDriver"
val jdbcHostname = "SONUAMRITH\\SQLEXPRESS"
val jdbcPort = 1434
val jdbcDatabase = "BooksAuthors"
val jdbcUrl = s"jdbc:sqlserver://${jdbcHostname}:${jdbcPort};database=${jdbcDatabase};trustServerCertificate=true;"
import java.util.Properties
val connectionProperties = new Properties()

connectionProperties.put("user", "sa")
connectionProperties.put("password","root")
connectionProperties.setProperty("Driver", driverClass)

driverClass: String = com.microsoft.sqlserver.jdbc.SQLServerDriver
jdbcHostname: String = SONUAMRITH\SQLEXPRESS
jdbcPort: Int = 1434
jdbcDatabase: String = BooksAuthors
jdbcUrl: String = jdbc:sqlserver://SONUAMRITH\SQLEXPRESS:1434;database=BooksAuthors;trustServerCertificate=true;
import java.util.Properties
connectionProperties: java.util.Properties = {password=root, Driver=com.microsoft.sqlserver.jdbc.SQLServerDriver, user=sa}
res13: Object = null

In [23]:
/* I want to save the data present inside the dataframe to Sql Database so that whenever i want to read the data i can read it
from the DB instead of executing each cell again and again after shutdown of kernel
*/
table.write.option("truncate","true").jdbc(jdbcUrl,"Refined_Table",connectionProperties)

In [29]:
spark.read.jdbc(jdbcUrl,"Refined_Table",connectionProperties).show(10)

+-------------+--------------------+---------------+------------------+-----+
|serial_number|        company_name|  employee_mark|       Description|Leave|
+-------------+--------------------+---------------+------------------+-----+
|9788189999599|      TALES OF SHIVA|           Mark|              mark|    0|
|9780099578079|1Q84 THE COMPLETE...|HARUKI MURAKAMI|              Mark|    0|
|9780198082897|            MY KUMAN|           Mark|              Mark|    0|
|9780007880331|THE GOD OF SMAAL ...|  ARUNDHATI ROY|4TH HARPER COLLINS|    2|
|9780545060455|    THE BLACK CIRCLE|           Mark|4TH HARPER COLLINS|    0|
|9788126525072|THE THREE LAWS OF...|           Mark|4TH HARPER COLLINS|    0|
|9789381626610|   CHAMarkKYA MANTRA|           Mark|4TH HARPER COLLINS|    0|
|9788184513523|            59.FLAGS|           Mark|4TH HARPER COLLINS|    0|
|9780743234801|THE POWER OF POSI...|           Mark|   A & A PUBLISHER|    0|
|9789381529621|YOU CAN IF YO THI...|          PEALE|   A & A PUBLISHER|    0|
+-------------+--------------------+---------------+------------------+-----+
only showing top 10 rows

In [ ]:
val samp=List(("sonu",26,56000),("sreeja",24,59000)).toDF("name","age","salary")

In [ ]:
def highSal(sal:Int):String={
    
    if(sal>56000){
        return "Low"
    }
    else{
        
        return "High"
    }
}

In [ ]:
spark.udf.register("highSal",highSal(_:Int):String)

In [ ]:
(samp.selectExpr("highSal(salary) as Designation"))